In [1]:
import numpy as np

import pandas as pd

In [2]:
taxi_trips = pd.read_csv(r"yellow_tripdata_2019-01.csv")

In [3]:
# taxi_trips.head(10)

taxi_trips

,tpep_pickup_datetime,passenger_count,trip_distance,PULocationID,payment_type,total_amount
0,2019-01-01 00:46:40,1.0,1.50,151,1,9.95
1,2019-01-01 00:59:47,1.0,2.60,239,1,16.30
2,2018-12-21 13:48:30,3.0,0.00,236,1,5.80
3,2018-11-28 15:52:25,5.0,0.00,193,2,7.55
4,2018-11-28 15:56:57,5.0,0.00,193,2,55.55
...,...,...,...,...,...,...
7696612,2019-01-31 23:37:20,NaN,10.24,142,0,0.00
7696613,2019-01-31 23:28:00,NaN,12.43,48,0,54.60
7696614,2019-01-31 23:11:00,NaN,9.14,159,0,54.60
7696615,2019-01-31 23:03:00,NaN,0.00,265,0,0.00
7696616,2019-01-31 23:41:03,NaN,12.30,237,0,0.00

## `1st way`

### Using built-in methods to find / check / view  missing values (i.e NaN  or  None)

###  `.isna().sum()`

####  It is used to find missing values (i.e NaN or None)

In [4]:
taxi_trips.isna().sum()

tpep_pickup_datetime        0
passenger_count         28672
trip_distance               0
PULocationID                0
payment_type                0
total_amount                0
dtype: int64

###  `.isnull().sum()`

#### Like .isna(),  .isnull()  is also  used to find missing values (i.e NaN or None)

In [5]:
taxi_trips.isnull().sum()

tpep_pickup_datetime        0
passenger_count         28672
trip_distance               0
PULocationID                0
payment_type                0
total_amount                0
dtype: int64

## `2nd way`

### For checking/viewing  unique values for each column  using value_counts()

###  `value_counts()`

In [6]:
# looking unique value counts for passenger_count column

taxi_trips['passenger_count'].value_counts()

passenger_count
1.0    5456515
2.0    1113894
5.0     323842
3.0     314692
6.0     200811
4.0     140753
0.0     117381
8.0         29
7.0         19
9.0          9
Name: count, dtype: int64

In [7]:
# looking unique value counts for payment_type column

taxi_trips['payment_type'].value_counts()

payment_type
1    5486263
2    2137336
3      33181
0      28672
4      11165
Name: count, dtype: int64

In [8]:
# looking unique value counts for PULocationID column

taxi_trips['PULocationID'].value_counts()

PULocationID
237    332785
236    323295
161    312855
162    277477
230    264134
        ...
204         3
176         2
199         2
84          1
104         1
Name: count, Length: 263, dtype: int64

## `3rd` way

### whenever value_counts() is unable to find/show tricky `NaN` or `nan` values,
### u better use, `.unique()` function,
### but u cannot check using `.unique()` method in the numeric values column, because all unique values won't be shown

In [9]:
passenger_unique_values = taxi_trips['passenger_count'].unique()

print(passenger_unique_values)

[ 1.  3.  5.  2.  4.  0.  6.  8.  7.  9. nan]

In [10]:
payment_unique_values = taxi_trips['payment_type'].unique()

print(payment_unique_values)

[1 2 4 3 0]

In [11]:
pulocationid_unique_values = taxi_trips['PULocationID'].unique()

print(pulocationid_unique_values)

[151 239 236 193 163 229 141 246 238 224 170 107  41 116 113 161 138 144
 231 237 263 132 264 142 249 137  90 162 140  68  88  74  79  75 233 148
  48 143   4 164 232  45  43 186 158  50 114  42  14  11 181 211  13 261
  97 234 125 145 262 226  24 166  80 189  33 100 126 159 244 243 209  87
  25 260 223 196 152 230   7  66 228 235 265 134  65 129  82 195 255 179
 169  89  37  17 225  12  52 112 256  61 257 215  70 217 177  49 168  76
 133 198  40 247 254 216  77 250 119 106 208  60 146 191  54 205  36 153
  34  78 130 241  69 124 190 203  19 213  10 218 174 248 222 157 160 188
  93 123  39  63  21  94 127  51  20  18 122  35  56 259 202  71  92 197
 136  62  83   8 120 220  95 173 165  81 227 128  67 183  16 147 201 167
 210  28 212  85  22  91  64  38  72  47  29 149 150 178 101   1 155 258
  98  32 221 171  23 242 192 187 182 180 185 121  96  26  57 131 109 108
 200 194  53  59 135 139 219   6 117 102   3  15  44  55  73 154 207  86
  46 251 252 111 240   9 253 115  58   5 175  31 184 245  30 118 156   2
 206 214 172 105  84 204  27  99 176 104 199]

### NOTE: It is pointless to use, `.unique()` function in numeric column, becuase all unique elements won't be shown

### i.e why we didn't do following:

### total_amount_unique_values = taxi_trips['total_amount'].unique()

## `4th way`

### Replace any tricky `Na` or `nan` with NaN,
### using `replace()` function

In [12]:
taxi_trips['passenger_count'] = taxi_trips['passenger_count'].replace('Na', np.nan)
taxi_trips['passenger_count'] = taxi_trips['passenger_count'].replace('nan', np.nan)

# taxi_trips['passenger_count'].isna().sum()

In [13]:
taxi_trips['payment_type'] = taxi_trips['payment_type'].replace('Na', np.nan)
taxi_trips['payment_type'] = taxi_trips['payment_type'].replace('nan', np.nan)

In [14]:
taxi_trips['total_amount'] = taxi_trips['total_amount'].replace('Na', np.nan)
taxi_trips['total_amount'] = taxi_trips['total_amount'].replace('nan', np.nan)

### again, recheck if tricky `Na` or `nan` values found ??

In [15]:
taxi_trips.isna().sum()

tpep_pickup_datetime        0
passenger_count         28672
trip_distance               0
PULocationID                0
payment_type                0
total_amount                0
dtype: int64

## `5th way`

### `dtypes`

### checking data type of column using `dtypes` attribute

####  NOTE: At initial, u might know, the data type of each column (like int64, float64),
#### NOTE: data type of datetime can also be shown object type

### but, sometimes `int64` or `float64` looking column is showing `object` data type,
### at this point, u can guess, this type of column may have tricky missing values like ('Na' or 'nan')

In [21]:
taxi_trips.dtypes

tpep_pickup_datetime    datetime64[ns]
passenger_count                float64
trip_distance                  float64
PULocationID                     int64
payment_type                     int64
total_amount                   float64
dtype: object

### while checking with dtypes attribute,
### if u find something fishing/unusual,
### then, try cast/converting the type of column to the type it is suppose to be,
### while converting/casting, if it throws `ValueError: ` then u can know, tricky missing values is present in that column

### using `pd.to_datetime()` function to cast/convert date & time column in datetime data type
### if following code throws error, u should know some missing value is there

In [22]:
taxi_trips['tpep_pickup_datetime'] = pd.to_datetime(taxi_trips['tpep_pickup_datetime'])

In [23]:
taxi_trips.dtypes

tpep_pickup_datetime    datetime64[ns]
passenger_count                float64
trip_distance                  float64
PULocationID                     int64
payment_type                     int64
total_amount                   float64
dtype: object

### `astype()`

### astype() function is also used to cast/convert column into any data type

In [24]:
taxi_trips['total_amount'] = taxi_trips['total_amount'].astype(float)

## `6th way`

## Sorting the values of column

In [25]:
taxi_trips['tpep_pickup_datetime'].sort_values()

2557806   2001-02-02 14:55:07
42121     2003-01-01 00:05:12
42122     2003-01-01 00:15:01
607528    2008-12-31 23:02:39
6405315   2008-12-31 23:03:07
                  ...
2873013   2019-07-23 01:32:57
2880113   2019-08-13 09:02:46
2884771   2019-09-03 17:03:08
4157545   2088-01-24 00:15:42
4165220   2088-01-24 00:25:39
Name: tpep_pickup_datetime, Length: 7696617, dtype: datetime64[ns]

In [26]:
# POINT TO REMEMBER:

# NOTE : yo mathi ko example ma 2088-01-24 chai practically possible chaina, becuase ahile just 2023 chaldai cha

## FIXING MISSING VALUES

### using inbuilt `fillna()` function

### 1st way: filling NaN with `frequent occuring values in that column`

In [27]:
# To view frequent occuring values of any column

taxi_trips['passenger_count'].value_counts()

passenger_count
1.0    5456515
2.0    1113894
5.0     323842
3.0     314692
6.0     200811
4.0     140753
0.0     117381
8.0         29
7.0         19
9.0          9
Name: count, dtype: int64

In [28]:
# since we now know,  1 is the most frequent occuring passenger count, so,
# filling NaN with 1

taxi_trips['passenger_count'].fillna('1', inplace=True)

### finally, checking is there still missing values in dataframe or not ?

In [29]:
taxi_trips.isna().sum()

tpep_pickup_datetime    0
passenger_count         0
trip_distance           0
PULocationID            0
payment_type            0
total_amount            0
dtype: int64

In [30]:
taxi_trips.isnull().sum()

tpep_pickup_datetime    0
passenger_count         0
trip_distance           0
PULocationID            0
payment_type            0
total_amount            0
dtype: int64